.back-to-markdown/2015/03/how-to-use-alt-text-attribute-properly.org.markdown
[how to use alt text attribute](http://www.garcialo.com/html101/alt2.html)
==========================================================================

**WARNING: This is old and likely obsolete.**

From: [HTML 101 Because You Were Taught Wrong](http://www.garcialo.com/html101/) added: \[2015-03-17 Tue 07:18\]

HTML Techniques for providing useful text alternatives: <http://www.w3.org/TR/html-alt-techniques/>
---------------------------------------------------------------------------------------------------

-   Always include the alt attribute

-   Put nothing in the alt attribute:
    -   If the image is just eye candy
    -   No important function
    -   No important information
-   Images of text: alt should be the

-   Keep it short and sweet.
    -   \"samurai cutting a watermelon in half\"
    -   \"child skiing down a mountain\"
    -   \"woman laughing alone with salad\" (/you\'re never alone with salad :grinning: /)
-   Don\'t say it\'s an image or photo.
-   Have your content creator provide the alt text.
-   \"What information are you trying to convey with this image?\"

Alt text on social media
------------------------

See: [Alt text on Social Media, Cane Adventures blog](https://caneadventures.blog/2019/12/02/alt-text-on-social-media/) for a perspective on using alt text from a visually impaired blogger
